codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl028.h
extern volatile __IPC10bits_t IPC10bits __asm__ ("IPC10") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC10CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC10SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC10INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC11 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned I2C2MIS:2;
    unsigned I2C2MIP:3;
    unsigned :3;
    unsigned I2C2BCIS:2;
    unsigned I2C2BCIP:3;
    unsigned :3;
    unsigned NVMIS:2;
    unsigned NVMIP:3;
    unsigned :3;
    unsigned CPCIS:2;
    unsigned CPCIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC11bits_t;
extern volatile __IPC11bits_t IPC11bits __asm__ ("IPC11") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC11CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC11SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC11INV __attribute__((section("sfrs")));
extern volatile unsigned int        IPC12 __attribute__((section("sfrs")));
typedef struct {
  unsigned :8;
  unsigned ECCSBEIS:2;
  unsigned ECCSBEIP:3;
} __IPC12bits_t;
extern volatile __IPC12bits_t IPC12bits __asm__ ("IPC12") __attribute__((section("sfrs")));
extern volatile unsigned int        IPC12CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IPC12SET __attribute__((section("sfrs")));
extern volatile unsigned int        IPC12INV __attribute__((section("sfrs")));
extern volatile unsigned int        FDEVOPT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :1;
    unsigned ALTCMP:1;
    unsigned :1;
    unsigned SOSCHP:1;
    unsigned ALTI2C:1;
    unsigned :10;
    unsigned USERID:17;
  };
  struct {
    unsigned w:32;
  };
} __FDEVOPTbits_t;
extern volatile __FDEVOPTbits_t FDEVOPTbits __asm__ ("FDEVOPT") __attribute__((section("sfrs")));
extern volatile unsigned int        FICD __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned JTAGEN:1;
    unsigned ICS:2;
  };
  struct {
    unsigned w:32;
  };
} __FICDbits_t;
extern volatile __FICDbits_t FICDbits __asm__ ("FICD") __attribute__((section("sfrs")));
extern volatile unsigned int        FPOR __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BOREN:2;
    unsigned RETVR:1;
    unsigned LPBOREN:1;
  };
  struct {
    unsigned w:32;
  };
} __FPORbits_t;
extern volatile __FPORbits_t FPORbits __asm__ ("FPOR") __attribute__((section("sfrs")));
extern volatile unsigned int        FWDT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SWDTPS:5;
    unsigned FWDTWINSZ:2;
    unsigned WINDIS:1;
    unsigned RWDTPS:5;
    unsigned RCLKSEL:2;
    unsigned FWDTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __FWDTbits_t;
extern volatile __FWDTbits_t FWDTbits __asm__ ("FWDT") __attribute__((section("sfrs")));
extern volatile unsigned int        FOSCSEL __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned :1;
    unsigned PLLSRC:1;
    unsigned :1;
    unsigned LPOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :1;
    unsigned SOSCSEL:1;
    unsigned :1;
    unsigned FCKSM:2;
  };
  struct {
    unsigned w:32;
  };
} __FOSCSELbits_t;
extern volatile __FOSCSELbits_t FOSCSELbits __asm__ ("FOSCSEL") __attribute__((section("sfrs")));
extern volatile unsigned int        FSEC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :31;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __FSECbits_t;
extern volatile __FSECbits_t FSECbits __asm__ ("FSEC") __attribute__((section("sfrs")));
#ifdef __cplusplus
}
#endif

#elif defined (__LANGUAGE_ASSEMBLY__)
  .extern RTCCON1          /* 0xBF800000 */
  .extern RTCCON1CLR       /* 0xBF800004 */
  .extern RTCCON1SET       /* 0xBF800008 */
  .extern RTCCON1INV       /* 0xBF80000C */
  .extern RTCCON2          /* 0xBF800010 */
  .extern RTCCON2CLR       /* 0xBF800014 */
  .extern RTCCON2SET       /* 0xBF800018 */
  .extern RTCCON2INV       /* 0xBF80001C */
  .extern RTCSTAT          /* 0xBF800030 */
  .extern RTCSTATCLR       /* 0xBF800034 */
  .extern RTCSTATSET       /* 0xBF800038 */
  .extern RTCSTATINV       /* 0xBF80003C */
  .extern RTCTIME          /* 0xBF800040 */
  .extern RTCTIMECLR       /* 0xBF800044 */
  .extern RTCTIMESET       /* 0xBF800048 */
  .extern RTCTIMEINV       /* 0xBF80004C */
  .extern RTCDATE          /* 0xBF800050 */
  .extern RTCDATECLR       /* 0xBF800054 */
  .extern RTCDATESET       /* 0xBF800058 */
  .extern RTCDATEINV       /* 0xBF80005C */
  .extern ALMTIME          /* 0xBF800060 */
  .extern ALMTIMECLR       /* 0xBF800064 */
  .extern ALMTIMESET       /* 0xBF800068 */
  .extern ALMTIMEINV       /* 0xBF80006C */
  .extern ALMDATE          /* 0xBF800070 */
  .extern ALMDATECLR       /* 0xBF800074 */
  .extern ALMDATESET       /* 0xBF800078 */
  .extern ALMDATEINV       /* 0xBF80007C */
  .extern CCP1CON1         /* 0xBF800100 */
  .extern CCP1CON1CLR      /* 0xBF800104 */
  .extern CCP1CON1SET      /* 0xBF800108 */
  .extern CCP1CON1INV      /* 0xBF80010C */
  .extern CCP1CON2         /* 0xBF800110 */
  .extern CCP1CON2CLR      /* 0xBF800114 */
  .extern CCP1CON2SET      /* 0xBF800118 */
  .extern CCP1CON2INV      /* 0xBF80011C */
  .extern CCP1CON3         /* 0xBF800120 */
  .extern CCP1CON3CLR      /* 0xBF800124 */
  .extern CCP1CON3SET      /* 0xBF800128 */
  .extern CCP1CON3INV      /* 0xBF80012C */
  .extern CCP1STAT         /* 0xBF800130 */
  .extern CCP1STATCLR      /* 0xBF800134 */
  .extern CCP1STATSET      /* 0xBF800138 */
  .extern CCP1STATINV      /* 0xBF80013C */
  .extern CCP1TMR          /* 0xBF800140 */
  .extern CCP1TMRCLR       /* 0xBF800144 */
  .extern CCP1TMRSET       /* 0xBF800148 */
  .extern CCP1TMRINV       /* 0xBF80014C */
  .extern CCP1PR           /* 0xBF800150 */
  .extern CCP1PRCLR        /* 0xBF800154 */
  .extern CCP1PRSET        /* 0xBF800158 */
  .extern CCP1PRINV        /* 0xBF80015C */
  .extern CCP1RA           /* 0xBF800160 */
  .extern CCP1RACLR        /* 0xBF800164 */
  .extern CCP1RASET        /* 0xBF800168 */
  .extern CCP1RAINV        /* 0xBF80016C */
  .extern CCP1RB           /* 0xBF800170 */
  .extern CCP1RBCLR        /* 0xBF800174 */
  .extern CCP1RBSET        /* 0xBF800178 */
  .extern CCP1RBINV        /* 0xBF80017C */
  .extern CCP1BUF          /* 0xBF800180 */
  .extern CCP1BUFCLR       /* 0xBF800184 */
  .extern CCP1BUFSET       /* 0xBF800188 */
  .extern CCP1BUFINV       /* 0xBF80018C */
  .extern CCP2CON1         /* 0xBF800200 */
  .extern CCP2CON1CLR      /* 0xBF800204 */
  .extern CCP2CON1SET      /* 0xBF800208 */
  .extern CCP2CON1INV      /* 0xBF80020C */
  .extern CCP2CON2         /* 0xBF800210 */
  .extern CCP2CON2CLR      /* 0xBF800214 */
  .extern CCP2CON2SET      /* 0xBF800218 */
  .extern CCP2CON2INV      /* 0xBF80021C */
  .extern CCP2CON3         /* 0xBF800220 */
  .extern CCP2CON3CLR      /* 0xBF800224 */
  .extern CCP2CON3SET      /* 0xBF800228 */
  .extern CCP2CON3INV      /* 0xBF80022C */
  .extern CCP2STAT         /* 0xBF800230 */
  .extern CCP2STATCLR      /* 0xBF800234 */
  .extern CCP2STATSET      /* 0xBF800238 */
  .extern CCP2STATINV      /* 0xBF80023C */
  .extern CCP2TMR          /* 0xBF800240 */
  .extern CCP2TMRCLR       /* 0xBF800244 */
  .extern CCP2TMRSET       /* 0xBF800248 */
  .extern CCP2TMRINV       /* 0xBF80024C */
  .extern CCP2PR           /* 0xBF800250 */
  .extern CCP2PRCLR        /* 0xBF800254 */
  .extern CCP2PRSET        /* 0xBF800258 */
  .extern CCP2PRINV        /* 0xBF80025C */
  .extern CCP2RA           /* 0xBF800260 */
  .extern CCP2RACLR        /* 0xBF800264 */
  .extern CCP2RASET        /* 0xBF800268 */
  .extern CCP2RAINV        /* 0xBF80026C */
  .extern CCP2RB           /* 0xBF800270 */
  .extern CCP2RBCLR        /* 0xBF800274 */
  .extern CCP2RBSET        /* 0xBF800278 */
  .extern CCP2RBINV        /* 0xBF80027C */
  .extern CCP2BUF          /* 0xBF800280 */
  .extern CCP2BUFCLR       /* 0xBF800284 */
  .extern CCP2BUFSET       /* 0xBF800288 */
  .extern CCP2BUFINV       /* 0xBF80028C */
  .extern CCP3CON1         /* 0xBF800300 */
  .extern CCP3CON1CLR      /* 0xBF800304 */
  .extern CCP3CON1SET      /* 0xBF800308 */
  .extern CCP3CON1INV      /* 0xBF80030C */
  .extern CCP3CON2         /* 0xBF800310 */
  .extern CCP3CON2CLR      /* 0xBF800314 */
  .extern CCP3CON2SET      /* 0xBF800318 */
  .extern CCP3CON2INV      /* 0xBF80031C */
  .extern CCP3CON3         /* 0xBF800320 */
  .extern CCP3CON3CLR      /* 0xBF800324 */
  .extern CCP3CON3SET      /* 0xBF800328 */
  .extern CCP3CON3INV      /* 0xBF80032C */
  .extern CCP3STAT         /* 0xBF800330 */
  .extern CCP3STATCLR      /* 0xBF800334 */
  .extern CCP3STATSET      /* 0xBF800338 */
  .extern CCP3STATINV      /* 0xBF80033C */
  .extern CCP3TMR          /* 0xBF800340 */
  .extern CCP3TMRCLR       /* 0xBF800344 */
  .extern CCP3TMRSET       /* 0xBF800348 */
  .extern CCP3TMRINV       /* 0xBF80034C */
  .extern CCP3PR           /* 0xBF800350 */
  .extern CCP3PRCLR        /* 0xBF800354 */
  .extern CCP3PRSET        /* 0xBF800358 */
  .extern CCP3PRINV        /* 0xBF80035C */
  .extern CCP3RA           /* 0xBF800360 */
  .extern CCP3RACLR        /* 0xBF800364 */
  .extern CCP3RASET        /* 0xBF800368 */
  .extern CCP3RAINV        /* 0xBF80036C */
  .extern CCP3RB           /* 0xBF800370 */
  .extern CCP3RBCLR        /* 0xBF800374 */
  .extern CCP3RBSET        /* 0xBF800378 */
  .extern CCP3RBINV        /* 0xBF80037C */
  .extern CCP3BUF          /* 0xBF800380 */
  .extern CCP3BUFCLR       /* 0xBF800384 */
  .extern CCP3BUFSET       /* 0xBF800388 */
  .extern CCP3BUFINV       /* 0xBF80038C */
  .extern I2C1CON          /* 0xBF800400 */
  .extern I2C1CONCLR       /* 0xBF800404 */
  .extern I2C1CONSET       /* 0xBF800408 */
  .extern I2C1CONINV       /* 0xBF80040C */
  .extern I2C1STAT         /* 0xBF800410 */
  .extern I2C1STATCLR      /* 0xBF800414 */
  .extern I2C1STATSET      /* 0xBF800418 */
  .extern I2C1STATINV      /* 0xBF80041C */
  .extern I2C1ADD          /* 0xBF800420 */
  .extern I2C1ADDCLR       /* 0xBF800424 */
  .extern I2C1ADDSET       /* 0xBF800428 */
  .extern I2C1ADDINV       /* 0xBF80042C */
  .extern I2C1MSK          /* 0xBF800430 */
  .extern I2C1MSKCLR       /* 0xBF800434 */
  .extern I2C1MSKSET       /* 0xBF800438 */
  .extern I2C1MSKINV       /* 0xBF80043C */
  .extern I2C1BRG          /* 0xBF800440 */
  .extern I2C1BRGCLR       /* 0xBF800444 */
  .extern I2C1BRGSET       /* 0xBF800448 */
  .extern I2C1BRGINV       /* 0xBF80044C */
  .extern I2C1TRN          /* 0xBF800450 */
  .extern I2C1TRNCLR       /* 0xBF800454 */
  .extern I2C1TRNSET       /* 0xBF800458 */
  .extern I2C1TRNINV       /* 0xBF80045C */
  .extern I2C1RCV          /* 0xBF800460 */
  .extern I2C1RCVCLR       /* 0xBF800464 */
  .extern I2C1RCVSET       /* 0xBF800468 */
  .extern I2C1RCVINV       /* 0xBF80046C */
  .extern I2C2CON          /* 0xBF800480 */
  .extern I2C2CONCLR       /* 0xBF800484 */
  .extern I2C2CONSET       /* 0xBF800488 */
  .extern I2C2CONINV       /* 0xBF80048C */
  .extern I2C2STAT         /* 0xBF800490 */
  .extern I2C2STATCLR      /* 0xBF800494 */
  .extern I2C2STATSET      /* 0xBF800498 */
  .extern I2C2STATINV      /* 0xBF80049C */
  .extern I2C2ADD          /* 0xBF8004A0 */
  .extern I2C2ADDCLR       /* 0xBF8004A4 */
  .extern I2C2ADDSET       /* 0xBF8004A8 */
  .extern I2C2ADDINV       /* 0xBF8004AC */
  .extern I2C2MSK          /* 0xBF8004B0 */
  .extern I2C2MSKCLR       /* 0xBF8004B4 */
  .extern I2C2MSKSET       /* 0xBF8004B8 */
  .extern I2C2MSKINV       /* 0xBF8004BC */
  .extern I2C2BRG          /* 0xBF8004C0 */
  .extern I2C2BRGCLR       /* 0xBF8004C4 */
  .extern I2C2BRGSET       /* 0xBF8004C8 */
  .extern I2C2BRGINV       /* 0xBF8004CC */
  .extern I2C2TRN          /* 0xBF8004D0 */
  .extern I2C2TRNCLR       /* 0xBF8004D4 */
  .extern I2C2TRNSET       /* 0xBF8004D8 */
  .extern I2C2TRNINV       /* 0xBF8004DC */
  .extern I2C2RCV          /* 0xBF8004E0 */
  .extern I2C2RCVCLR       /* 0xBF8004E4 */
  .extern I2C2RCVSET       /* 0xBF8004E8 */
  .extern I2C2RCVINV       /* 0xBF8004EC */
  .extern U1MODE           /* 0xBF800600 */
  .extern U1MODECLR        /* 0xBF800604 */
  .extern U1MODESET        /* 0xBF800608 */
  .extern U1MODEINV        /* 0xBF80060C */
  .extern U1STA            /* 0xBF800610 */
  .extern U1STACLR         /* 0xBF800614 */
  .extern U1STASET         /* 0xBF800618 */
  .extern U1STAINV         /* 0xBF80061C */
  .extern U1TXREG          /* 0xBF800620 */
  .extern U1RXREG          /* 0xBF800630 */
  .extern U1BRG            /* 0xBF800640 */
  .extern U1BRGCLR         /* 0xBF800644 */
  .extern U1BRGSET         /* 0xBF800648 */
  .extern U1BRGINV         /* 0xBF80064C */
  .extern U2MODE           /* 0xBF800680 */
  .extern U2MODECLR        /* 0xBF800684 */
  .extern U2MODESET        /* 0xBF800688 */
  .extern U2MODEINV        /* 0xBF80068C */
  .extern U2STA            /* 0xBF800690 */
  .extern U2STACLR         /* 0xBF800694 */
  .extern U2STASET         /* 0xBF800698 */
  .extern U2STAINV         /* 0xBF80069C */
  .extern U2TXREG          /* 0xBF8006A0 */
  .extern U2RXREG          /* 0xBF8006B0 */
  .extern U2BRG            /* 0xBF8006C0 */
  .extern U2BRGCLR         /* 0xBF8006C4 */
  .extern U2BRGSET         /* 0xBF8006C8 */
  .extern U2BRGINV         /* 0xBF8006CC */
  .extern ADC1BUF0         /* 0xBF800700 */
  .extern ADC1BUF0CLR      /* 0xBF800704 */
  .extern ADC1BUF0SET      /* 0xBF800708 */
  .extern ADC1BUF0INV      /* 0xBF80070C */
  .extern ADC1BUF1         /* 0xBF800710 */
  .extern ADC1BUF1CLR      /* 0xBF800714 */
  .extern ADC1BUF1SET      /* 0xBF800718 */
  .extern ADC1BUF1INV      /* 0xBF80071C */
  .extern ADC1BUF2         /* 0xBF800720 */
  .extern ADC1BUF2CLR      /* 0xBF800724 */
  .extern ADC1BUF2SET      /* 0xBF800728 */
  .extern ADC1BUF2INV      /* 0xBF80072C */
  .extern ADC1BUF3         /* 0xBF800730 */
  .extern ADC1BUF3CLR      /* 0xBF800734 */
  .extern ADC1BUF3SET      /* 0xBF800738 */
  .extern ADC1BUF3INV      /* 0xBF80073C */
  .extern ADC1BUF4         /* 0xBF800740 */
  .extern ADC1BUF4CLR      /* 0xBF800744 */
  .extern ADC1BUF4SET      /* 0xBF800748 */
  .extern ADC1BUF4INV      /* 0xBF80074C */
  .extern ADC1BUF5         /* 0xBF800750 */
  .extern ADC1BUF5CLR      /* 0xBF800754 */
  .extern ADC1BUF5SET      /* 0xBF800758 */
  .extern ADC1BUF5INV      /* 0xBF80075C */
  .extern ADC1BUF6         /* 0xBF800760 */
  .extern ADC1BUF6CLR      /* 0xBF800764 */
  .extern ADC1BUF6SET      /* 0xBF800768 */
  .extern ADC1BUF6INV      /* 0xBF80076C */
  .extern ADC1BUF7         /* 0xBF800770 */
  .extern ADC1BUF7CLR      /* 0xBF800774 */
  .extern ADC1BUF7SET      /* 0xBF800778 */
  .extern ADC1BUF7INV      /* 0xBF80077C */
  .extern ADC1BUF8         /* 0xBF800780 */
  .extern ADC1BUF8CLR      /* 0xBF800784 */
  .extern ADC1BUF8SET      /* 0xBF800788 */
  .extern ADC1BUF8INV      /* 0xBF80078C */
  .extern ADC1BUF9         /* 0xBF800790 */
  .extern ADC1BUF9CLR      /* 0xBF800794 */
  .extern ADC1BUF9SET      /* 0xBF800798 */
  .extern ADC1BUF9INV      /* 0xBF80079C */
  .extern ADC1BUF10        /* 0xBF8007A0 */
  .extern ADC1BUF10CLR     /* 0xBF8007A4 */
  .extern ADC1BUF10SET     /* 0xBF8007A8 */
  .extern ADC1BUF10INV     /* 0xBF8007AC */
  .extern ADC1BUF11        /* 0xBF8007B0 */
  .extern ADC1BUF11CLR     /* 0xBF8007B4 */
  .extern ADC1BUF11SET     /* 0xBF8007B8 */
  .extern ADC1BUF11INV     /* 0xBF8007BC */
  .extern ADC1BUF12        /* 0xBF8007C0 */
  .extern ADC1BUF12CLR     /* 0xBF8007C4 */
  .extern ADC1BUF12SET     /* 0xBF8007C8 */
  .extern ADC1BUF12INV     /* 0xBF8007CC */
  .extern ADC1BUF13        /* 0xBF8007D0 */
  .extern ADC1BUF13CLR     /* 0xBF8007D4 */
  .extern ADC1BUF13SET     /* 0xBF8007D8 */
  .extern ADC1BUF13INV     /* 0xBF8007DC */
  .extern AD1CON1          /* 0xBF8007E0 */
  .extern AD1CON1CLR       /* 0xBF8007E4 */
  .extern AD1CON1SET       /* 0xBF8007E8 */
  .extern AD1CON1INV       /* 0xBF8007EC */
  .extern AD1CON2          /* 0xBF8007F0 */
  .extern AD1CON2CLR       /* 0xBF8007F4 */
  .extern AD1CON2SET       /* 0xBF8007F8 */
  .extern AD1CON2INV       /* 0xBF8007FC */
  .extern AD1CON3          /* 0xBF800800 */
  .extern AD1CON3CLR       /* 0xBF800804 */
  .extern AD1CON3SET       /* 0xBF800808 */
  .extern AD1CON3INV       /* 0xBF80080C */
  .extern AD1CHS           /* 0xBF800810 */
  .extern AD1CHSCLR        /* 0xBF800814 */
  .extern AD1CHSSET        /* 0xBF800818 */
  .extern AD1CHSINV        /* 0xBF80081C */
  .extern AD1CSS           /* 0xBF800820 */
  .extern AD1CSSCLR        /* 0xBF800824 */
  .extern AD1CSSSET        /* 0xBF800828 */
  .extern AD1CSSINV        /* 0xBF80082C */
  .extern AD1CON5          /* 0xBF800840 */
  .extern AD1CON5CLR       /* 0xBF800844 */
  .extern AD1CON5SET       /* 0xBF800848 */
  .extern AD1CON5INV       /* 0xBF80084C */
  .extern AD1HIT           /* 0xBF800850 */
  .extern AD1HITCLR        /* 0xBF800854 */
  .extern AD1HITSET        /* 0xBF800858 */
  .extern AD1HITINV        /* 0xBF80085C */
  .extern CMSTAT           /* 0xBF800900 */
  .extern CMSTATCLR        /* 0xBF800904 */
  .extern CMSTATSET        /* 0xBF800908 */
  .extern CMSTATINV        /* 0xBF80090C */
  .extern CM1CON           /* 0xBF800910 */
  .extern CM1CONCLR        /* 0xBF800914 */
  .extern CM1CONSET        /* 0xBF800918 */
  .extern CM1CONINV        /* 0xBF80091C */
  .extern CM2CON           /* 0xBF800930 */
  .extern CM2CONCLR        /* 0xBF800934 */
  .extern CM2CONSET        /* 0xBF800938 */
  .extern CM2CONINV        /* 0xBF80093C */
  .extern VR1CON           /* 0xBF800980 */
  .extern VR1CONCLR        /* 0xBF800984 */
  .extern VR1CONSET        /* 0xBF800988 */
  .extern VR1CONINV        /* 0xBF80098C */
  .extern CRCCON           /* 0xBF800A00 */
  .extern CRCCONCLR        /* 0xBF800A04 */
  .extern CRCCONSET        /* 0xBF800A08 */
  .extern CRCCONINV        /* 0xBF800A0C */
  .extern CRCXOR           /* 0xBF800A10 */
  .extern CRCXORCLR        /* 0xBF800A14 */
  .extern CRCXORSET        /* 0xBF800A18 */
  .extern CRCXORINV        /* 0xBF800A1C */
  .extern CRCDAT           /* 0xBF800A20 */
  .extern CRCDATCLR        /* 0xBF800A24 */
  .extern CRCDATSET        /* 0xBF800A28 */
  .extern CRCDATINV        /* 0xBF800A2C */
  .extern CRCWDAT          /* 0xBF800A30 */
  .extern CRCWDATCLR       /* 0xBF800A34 */
  .extern CRCWDATSET       /* 0xBF800A38 */
  .extern CRCWDATINV       /* 0xBF800A3C */
  .extern CLC1CON          /* 0xBF800A80 */
  .extern CLC1CONCLR       /* 0xBF800A84 */
  .extern CLC1CONSET       /* 0xBF800A88 */
  .extern CLC1CONINV       /* 0xBF800A8C */
  .extern CLC1SEL          /* 0xBF800A90 */
  .extern CLC1SELCLR       /* 0xBF800A94 */
  .extern CLC1SELSET       /* 0xBF800A98 */
  .extern CLC1SELINV       /* 0xBF800A9C */
  .extern CLC1GLS          /* 0xBF800AA0 */
  .extern CLC1GLSCLR       /* 0xBF800AA4 */
  .extern CLC1GLSSET       /* 0xBF800AA8 */
  .extern CLC1GLSINV       /* 0xBF800AAC */
  .extern CLC2CON          /* 0xBF800B00 */
  .extern CLC2CONCLR       /* 0xBF800B04 */
  .extern CLC2CONSET       /* 0xBF800B08 */
  .extern CLC2CONINV       /* 0xBF800B0C */
  .extern CLC2SEL          /* 0xBF800B10 */
  .extern CLC2SELCLR       /* 0xBF800B14 */
  .extern CLC2SELSET       /* 0xBF800B18 */
  .extern CLC2SELINV       /* 0xBF800B1C */
  .extern CLC2GLS          /* 0xBF800B20 */
  .extern CLC2GLSCLR       /* 0xBF800B24 */
  .extern CLC2GLSSET       /* 0xBF800B28 */
  .extern CLC2GLSINV       /* 0xBF800B2C */
  .extern OSCCON           /* 0xBF802000 */
  .extern OSCCONCLR        /* 0xBF802004 */
  .extern OSCCONSET        /* 0xBF802008 */
  .extern OSCCONINV        /* 0xBF80200C */
  .extern SPLLCON          /* 0xBF802020 */
  .extern SPLLCONCLR       /* 0xBF802024 */
  .extern SPLLCONSET       /* 0xBF802028 */
  .extern SPLLCONINV       /* 0xBF80202C */
  .extern RCON             /* 0xBF802060 */
  .extern RCONCLR          /* 0xBF802064 */
  .extern RCONSET          /* 0xBF802068 */
  .extern RCONINV          /* 0xBF80206C */
  .extern RSWRST           /* 0xBF802070 */
  .extern RSWRSTCLR        /* 0xBF802074 */
  .extern RSWRSTSET        /* 0xBF802078 */
  .extern RSWRSTINV        /* 0xBF80207C */
  .extern RNMICON          /* 0xBF802080 */
  .extern RNMICONCLR       /* 0xBF802084 */
  .extern RNMICONSET       /* 0xBF802088 */
  .extern RNMICONINV       /* 0xBF80208C */
  .extern PWRCON           /* 0xBF802090 */
  .extern PWRCONCLR        /* 0xBF802094 */
  .extern PWRCONSET        /* 0xBF802098 */
  .extern PWRCONINV        /* 0xBF80209C */
  .extern REFO1CON         /* 0xBF8020A0 */
  .extern REFO1CONCLR      /* 0xBF8020A4 */
  .extern REFO1CONSET      /* 0xBF8020A8 */
  .extern REFO1CONINV      /* 0xBF8020AC */
  .extern REFO1TRIM        /* 0xBF8020B0 */
  .extern REFO1TRIMCLR     /* 0xBF8020B4 */
  .extern REFO1TRIMSET     /* 0xBF8020B8 */
  .extern REFO1TRIMINV     /* 0xBF8020BC */
  .extern CLKSTAT          /* 0xBF8021D0 */
  .extern CLKSTATCLR       /* 0xBF8021D4 */
  .extern CLKSTATSET       /* 0xBF8021D8 */
  .extern CLKSTATINV       /* 0xBF8021DC */
  .extern OSCTUN           /* 0xBF802200 */
  .extern OSCTUNCLR        /* 0xBF802204 */
  .extern OSCTUNSET        /* 0xBF802208 */
  .extern OSCTUNINV        /* 0xBF80220C */
  .extern DCOCON           /* 0xBF802280 */
  .extern DCOCONCLR        /* 0xBF802284 */
  .extern DCOCONSET        /* 0xBF802288 */
  .extern DCOCONINV        /* 0xBF80228C */
  .extern ANCFG            /* 0xBF802300 */
  .extern ANCFGCLR         /* 0xBF802304 */
  .extern ANCFGSET         /* 0xBF802308 */
  .extern ANCFGINV         /* 0xBF80230C */
  .extern HLVDCON          /* 0xBF802310 */
  .extern HLVDCONCLR       /* 0xBF802314 */
  .extern HLVDCONSET       /* 0xBF802318 */
  .extern HLVDCONINV       /* 0xBF80231C */
  .extern NVMCON           /* 0xBF802380 */
  .extern NVMCONCLR        /* 0xBF802384 */
  .extern NVMCONSET        /* 0xBF802388 */
  .extern NVMCONINV        /* 0xBF80238C */
  .extern NVMKEY           /* 0xBF802390 */
  .extern NVMKEYCLR        /* 0xBF802394 */
  .extern NVMKEYSET        /* 0xBF802398 */
  .extern NVMKEYINV        /* 0xBF80239C */
  .extern NVMADDR          /* 0xBF8023A0 */
  .extern NVMADDRCLR       /* 0xBF8023A4 */
  .extern NVMADDRSET       /* 0xBF8023A8 */
  .extern NVMADDRINV       /* 0xBF8023AC */
  .extern NVMDATA0         /* 0xBF8023B0 */
  .extern NVMDATA0CLR      /* 0xBF8023B4 */
  .extern NVMDATA0SET      /* 0xBF8023B8 */
  .extern NVMDATA0INV      /* 0xBF8023BC */
  .extern NVMDATA1         /* 0xBF8023C0 */
  .extern NVMDATA1CLR      /* 0xBF8023C4 */
  .extern NVMDATA1SET      /* 0xBF8023C8 */
  .extern NVMDATA1INV      /* 0xBF8023CC */
  .extern NVMSRCADDR       /* 0xBF8023D0 */
  .extern NVMSRCADDRCLR    /* 0xBF8023D4 */
  .extern NVMSRCADDRSET    /* 0xBF8023D8 */
  .extern NVMSRCADDRINV    /* 0xBF8023DC */
  .extern NVMPWP           /* 0xBF8023E0 */
  .extern NVMPWPCLR        /* 0xBF8023E4 */
  .extern NVMPWPSET        /* 0xBF8023E8 */
  .extern NVMPWPINV        /* 0xBF8023EC */
  .extern NVMBWP           /* 0xBF8023F0 */
  .extern NVMBWPCLR        /* 0xBF8023F4 */
  .extern NVMBWPSET        /* 0xBF8023F8 */
  .extern NVMBWPINV        /* 0xBF8023FC */
  .extern RPCON            /* 0xBF802480 */
  .extern RPCONCLR         /* 0xBF802484 */
  .extern RPCONSET         /* 0xBF802488 */
  .extern RPCONINV         /* 0xBF80248C */
  .extern RPINR1           /* 0xBF8024A0 */
  .extern RPINR1CLR        /* 0xBF8024A4 */
  .extern RPINR1SET        /* 0xBF8024A8 */
  .extern RPINR1INV        /* 0xBF8024AC */
  .extern RPINR2           /* 0xBF8024B0 */
  .extern RPINR2CLR        /* 0xBF8024B4 */
  .extern RPINR2SET        /* 0xBF8024B8 */
  .extern RPINR2INV        /* 0xBF8024BC */
  .extern RPINR3           /* 0xBF8024C0 */
  .extern RPINR3CLR        /* 0xBF8024C4 */
