codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl028.h
#define _CRCXOR_X21_POSITION                     0x00000015
#define _CRCXOR_X21_MASK                         0x00200000
#define _CRCXOR_X21_LENGTH                       0x00000001

#define _CRCXOR_X22_POSITION                     0x00000016
#define _CRCXOR_X22_MASK                         0x00400000
#define _CRCXOR_X22_LENGTH                       0x00000001

#define _CRCXOR_X23_POSITION                     0x00000017
#define _CRCXOR_X23_MASK                         0x00800000
#define _CRCXOR_X23_LENGTH                       0x00000001

#define _CRCXOR_X24_POSITION                     0x00000018
#define _CRCXOR_X24_MASK                         0x01000000
#define _CRCXOR_X24_LENGTH                       0x00000001

#define _CRCXOR_X25_POSITION                     0x00000019
#define _CRCXOR_X25_MASK                         0x02000000
#define _CRCXOR_X25_LENGTH                       0x00000001

#define _CRCXOR_X26_POSITION                     0x0000001A
#define _CRCXOR_X26_MASK                         0x04000000
#define _CRCXOR_X26_LENGTH                       0x00000001

#define _CRCXOR_X27_POSITION                     0x0000001B
#define _CRCXOR_X27_MASK                         0x08000000
#define _CRCXOR_X27_LENGTH                       0x00000001

#define _CRCXOR_X28_POSITION                     0x0000001C
#define _CRCXOR_X28_MASK                         0x10000000
#define _CRCXOR_X28_LENGTH                       0x00000001

#define _CRCXOR_X29_POSITION                     0x0000001D
#define _CRCXOR_X29_MASK                         0x20000000
#define _CRCXOR_X29_LENGTH                       0x00000001

#define _CRCXOR_X30_POSITION                     0x0000001E
#define _CRCXOR_X30_MASK                         0x40000000
#define _CRCXOR_X30_LENGTH                       0x00000001

#define _CRCXOR_X31_POSITION                     0x0000001F
#define _CRCXOR_X31_MASK                         0x80000000
#define _CRCXOR_X31_LENGTH                       0x00000001

#define _CRCXOR_w_POSITION                       0x00000000
#define _CRCXOR_w_MASK                           0xFFFFFFFF
#define _CRCXOR_w_LENGTH                         0x00000020

#define _CRCDAT_CRCDAT_POSITION                  0x00000000
#define _CRCDAT_CRCDAT_MASK                      0xFFFFFFFF
#define _CRCDAT_CRCDAT_LENGTH                    0x00000020

#define _CRCWDAT_CRCWDAT_POSITION                0x00000000
#define _CRCWDAT_CRCWDAT_MASK                    0xFFFFFFFF
#define _CRCWDAT_CRCWDAT_LENGTH                  0x00000020

#define _CLC1CON_MODE_POSITION                   0x00000000
#define _CLC1CON_MODE_MASK                       0x00000007
#define _CLC1CON_MODE_LENGTH                     0x00000003

#define _CLC1CON_LCPOL_POSITION                  0x00000005
#define _CLC1CON_LCPOL_MASK                      0x00000020
#define _CLC1CON_LCPOL_LENGTH                    0x00000001

#define _CLC1CON_LCOUT_POSITION                  0x00000006
#define _CLC1CON_LCOUT_MASK                      0x00000040
#define _CLC1CON_LCOUT_LENGTH                    0x00000001

#define _CLC1CON_LCOE_POSITION                   0x00000007
#define _CLC1CON_LCOE_MASK                       0x00000080
#define _CLC1CON_LCOE_LENGTH                     0x00000001

#define _CLC1CON_INTN_POSITION                   0x0000000A
#define _CLC1CON_INTN_MASK                       0x00000400
#define _CLC1CON_INTN_LENGTH                     0x00000001

#define _CLC1CON_INTP_POSITION                   0x0000000B
#define _CLC1CON_INTP_MASK                       0x00000800
#define _CLC1CON_INTP_LENGTH                     0x00000001

#define _CLC1CON_SIDL_POSITION                   0x0000000D
#define _CLC1CON_SIDL_MASK                       0x00002000
#define _CLC1CON_SIDL_LENGTH                     0x00000001

#define _CLC1CON_FRZ_POSITION                    0x0000000E
#define _CLC1CON_FRZ_MASK                        0x00004000
#define _CLC1CON_FRZ_LENGTH                      0x00000001

#define _CLC1CON_ON_POSITION                     0x0000000F
#define _CLC1CON_ON_MASK                         0x00008000
#define _CLC1CON_ON_LENGTH                       0x00000001

#define _CLC1CON_G1POL_POSITION                  0x00000010
#define _CLC1CON_G1POL_MASK                      0x00010000
#define _CLC1CON_G1POL_LENGTH                    0x00000001

#define _CLC1CON_G2POL_POSITION                  0x00000011
#define _CLC1CON_G2POL_MASK                      0x00020000
#define _CLC1CON_G2POL_LENGTH                    0x00000001

#define _CLC1CON_G3POL_POSITION                  0x00000012
#define _CLC1CON_G3POL_MASK                      0x00040000
#define _CLC1CON_G3POL_LENGTH                    0x00000001

#define _CLC1CON_G4POL_POSITION                  0x00000013
#define _CLC1CON_G4POL_MASK                      0x00080000
#define _CLC1CON_G4POL_LENGTH                    0x00000001

#define _CLC1CON_w_POSITION                      0x00000000
#define _CLC1CON_w_MASK                          0xFFFFFFFF
#define _CLC1CON_w_LENGTH                        0x00000020

#define _CLC1SEL_DS1_POSITION                    0x00000000
#define _CLC1SEL_DS1_MASK                        0x00000007
#define _CLC1SEL_DS1_LENGTH                      0x00000003

#define _CLC1SEL_DS2_POSITION                    0x00000004
#define _CLC1SEL_DS2_MASK                        0x00000070
#define _CLC1SEL_DS2_LENGTH                      0x00000003

#define _CLC1SEL_DS3_POSITION                    0x00000008
#define _CLC1SEL_DS3_MASK                        0x00000700
#define _CLC1SEL_DS3_LENGTH                      0x00000003

#define _CLC1SEL_DS4_POSITION                    0x0000000C
#define _CLC1SEL_DS4_MASK                        0x00007000
#define _CLC1SEL_DS4_LENGTH                      0x00000003

#define _CLC1SEL_w_POSITION                      0x00000000
#define _CLC1SEL_w_MASK                          0xFFFFFFFF
#define _CLC1SEL_w_LENGTH                        0x00000020

#define _CLC1GLS_G1D1N_POSITION                  0x00000000
#define _CLC1GLS_G1D1N_MASK                      0x00000001
#define _CLC1GLS_G1D1N_LENGTH                    0x00000001

#define _CLC1GLS_G1D1T_POSITION                  0x00000001
#define _CLC1GLS_G1D1T_MASK                      0x00000002
#define _CLC1GLS_G1D1T_LENGTH                    0x00000001

#define _CLC1GLS_G1D2N_POSITION                  0x00000002
#define _CLC1GLS_G1D2N_MASK                      0x00000004
#define _CLC1GLS_G1D2N_LENGTH                    0x00000001

#define _CLC1GLS_G1D2T_POSITION                  0x00000003
#define _CLC1GLS_G1D2T_MASK                      0x00000008
#define _CLC1GLS_G1D2T_LENGTH                    0x00000001

#define _CLC1GLS_G1D3N_POSITION                  0x00000004
#define _CLC1GLS_G1D3N_MASK                      0x00000010
#define _CLC1GLS_G1D3N_LENGTH                    0x00000001

#define _CLC1GLS_G1D3T_POSITION                  0x00000005
#define _CLC1GLS_G1D3T_MASK                      0x00000020
#define _CLC1GLS_G1D3T_LENGTH                    0x00000001

