codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl028.h
#define _IEC1_U2RXIE_POSITION                    0x00000008
#define _IEC1_U2RXIE_MASK                        0x00000100
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x00000009
#define _IEC1_U2TXIE_MASK                        0x00000200
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_U2EIE_POSITION                     0x0000000A
#define _IEC1_U2EIE_MASK                         0x00000400
#define _IEC1_U2EIE_LENGTH                       0x00000001

#define _IEC1_I2C2SIE_POSITION                   0x0000000B
#define _IEC1_I2C2SIE_MASK                       0x00000800
#define _IEC1_I2C2SIE_LENGTH                     0x00000001

#define _IEC1_I2C2MIE_POSITION                   0x0000000C
#define _IEC1_I2C2MIE_MASK                       0x00001000
#define _IEC1_I2C2MIE_LENGTH                     0x00000001

#define _IEC1_I2C2BCIE_POSITION                  0x0000000D
#define _IEC1_I2C2BCIE_MASK                      0x00002000
#define _IEC1_I2C2BCIE_LENGTH                    0x00000001

#define _IEC1_NVMIE_POSITION                     0x0000000E
#define _IEC1_NVMIE_MASK                         0x00004000
#define _IEC1_NVMIE_LENGTH                       0x00000001

#define _IEC1_CPCIE_POSITION                     0x0000000F
#define _IEC1_CPCIE_MASK                         0x00008000
#define _IEC1_CPCIE_LENGTH                       0x00000001

#define _IEC1_ECCSBEIE_POSITION                  0x00000011
#define _IEC1_ECCSBEIE_MASK                      0x00020000
#define _IEC1_ECCSBEIE_LENGTH                    0x00000001

#define _IEC1_w_POSITION                         0x00000000
#define _IEC1_w_MASK                             0xFFFFFFFF
#define _IEC1_w_LENGTH                           0x00000020

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

#define _IPC0_CS1IS_POSITION                     0x00000010
#define _IPC0_CS1IS_MASK                         0x00030000
#define _IPC0_CS1IS_LENGTH                       0x00000002

#define _IPC0_CS1IP_POSITION                     0x00000012
#define _IPC0_CS1IP_MASK                         0x001C0000
#define _IPC0_CS1IP_LENGTH                       0x00000003

#define _IPC0_INT0IS_POSITION                    0x00000018
#define _IPC0_INT0IS_MASK                        0x03000000
#define _IPC0_INT0IS_LENGTH                      0x00000002

#define _IPC0_INT0IP_POSITION                    0x0000001A
#define _IPC0_INT0IP_MASK                        0x1C000000
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_w_POSITION                         0x00000000
#define _IPC0_w_MASK                             0xFFFFFFFF
#define _IPC0_w_LENGTH                           0x00000020

#define _IPC1_INT1IS_POSITION                    0x00000000
#define _IPC1_INT1IS_MASK                        0x00000003
#define _IPC1_INT1IS_LENGTH                      0x00000002

#define _IPC1_INT1IP_POSITION                    0x00000002
#define _IPC1_INT1IP_MASK                        0x0000001C
#define _IPC1_INT1IP_LENGTH                      0x00000003

#define _IPC1_INT2IS_POSITION                    0x00000008
#define _IPC1_INT2IS_MASK                        0x00000300
#define _IPC1_INT2IS_LENGTH                      0x00000002

#define _IPC1_INT2IP_POSITION                    0x0000000A
#define _IPC1_INT2IP_MASK                        0x00001C00
#define _IPC1_INT2IP_LENGTH                      0x00000003

#define _IPC1_INT3IS_POSITION                    0x00000010
#define _IPC1_INT3IS_MASK                        0x00030000
#define _IPC1_INT3IS_LENGTH                      0x00000002

#define _IPC1_INT3IP_POSITION                    0x00000012
#define _IPC1_INT3IP_MASK                        0x001C0000
#define _IPC1_INT3IP_LENGTH                      0x00000003

#define _IPC1_INT4IS_POSITION                    0x00000018
#define _IPC1_INT4IS_MASK                        0x03000000
#define _IPC1_INT4IS_LENGTH                      0x00000002

#define _IPC1_INT4IP_POSITION                    0x0000001A
#define _IPC1_INT4IP_MASK                        0x1C000000
#define _IPC1_INT4IP_LENGTH                      0x00000003

#define _IPC1_w_POSITION                         0x00000000
#define _IPC1_w_MASK                             0xFFFFFFFF
#define _IPC1_w_LENGTH                           0x00000020

#define _IPC2_CNAIS_POSITION                     0x00000000
#define _IPC2_CNAIS_MASK                         0x00000003
#define _IPC2_CNAIS_LENGTH                       0x00000002

#define _IPC2_CNAIP_POSITION                     0x00000002
#define _IPC2_CNAIP_MASK                         0x0000001C
#define _IPC2_CNAIP_LENGTH                       0x00000003

#define _IPC2_CNBIS_POSITION                     0x00000008
#define _IPC2_CNBIS_MASK                         0x00000300
#define _IPC2_CNBIS_LENGTH                       0x00000002

#define _IPC2_CNBIP_POSITION                     0x0000000A
#define _IPC2_CNBIP_MASK                         0x00001C00
#define _IPC2_CNBIP_LENGTH                       0x00000003

#define _IPC2_CNCIS_POSITION                     0x00000010
#define _IPC2_CNCIS_MASK                         0x00030000
#define _IPC2_CNCIS_LENGTH                       0x00000002

#define _IPC2_CNCIP_POSITION                     0x00000012
#define _IPC2_CNCIP_MASK                         0x001C0000
#define _IPC2_CNCIP_LENGTH                       0x00000003

#define _IPC2_T1IS_POSITION                      0x00000018
#define _IPC2_T1IS_MASK                          0x03000000
#define _IPC2_T1IS_LENGTH                        0x00000002

#define _IPC2_T1IP_POSITION                      0x0000001A
#define _IPC2_T1IP_MASK                          0x1C000000
#define _IPC2_T1IP_LENGTH                        0x00000003

#define _IPC2_w_POSITION                         0x00000000
#define _IPC2_w_MASK                             0xFFFFFFFF
#define _IPC2_w_LENGTH                           0x00000020

#define _IPC3_CMP1IS_POSITION                    0x00000000
#define _IPC3_CMP1IS_MASK                        0x00000003
#define _IPC3_CMP1IS_LENGTH                      0x00000002

#define _IPC3_CMP1IP_POSITION                    0x00000002
#define _IPC3_CMP1IP_MASK                        0x0000001C
#define _IPC3_CMP1IP_LENGTH                      0x00000003

