codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0016gpl028.h
#define _FWDT_RWDTPS_POSITION                    0x00000008
#define _FWDT_RWDTPS_MASK                        0x00001F00
#define _FWDT_RWDTPS_LENGTH                      0x00000005

#define _FWDT_RCLKSEL_POSITION                   0x0000000D
#define _FWDT_RCLKSEL_MASK                       0x00006000
#define _FWDT_RCLKSEL_LENGTH                     0x00000002

#define _FWDT_FWDTEN_POSITION                    0x0000000F
#define _FWDT_FWDTEN_MASK                        0x00008000
#define _FWDT_FWDTEN_LENGTH                      0x00000001

#define _FWDT_w_POSITION                         0x00000000
#define _FWDT_w_MASK                             0xFFFFFFFF
#define _FWDT_w_LENGTH                           0x00000020

#define _FOSCSEL_FNOSC_POSITION                  0x00000000
#define _FOSCSEL_FNOSC_MASK                      0x00000007
#define _FOSCSEL_FNOSC_LENGTH                    0x00000003

#define _FOSCSEL_PLLSRC_POSITION                 0x00000004
#define _FOSCSEL_PLLSRC_MASK                     0x00000010
#define _FOSCSEL_PLLSRC_LENGTH                   0x00000001

#define _FOSCSEL_LPOSCEN_POSITION                0x00000006
#define _FOSCSEL_LPOSCEN_MASK                    0x00000040
#define _FOSCSEL_LPOSCEN_LENGTH                  0x00000001

#define _FOSCSEL_IESO_POSITION                   0x00000007
#define _FOSCSEL_IESO_MASK                       0x00000080
#define _FOSCSEL_IESO_LENGTH                     0x00000001

#define _FOSCSEL_POSCMOD_POSITION                0x00000008
#define _FOSCSEL_POSCMOD_MASK                    0x00000300
#define _FOSCSEL_POSCMOD_LENGTH                  0x00000002

#define _FOSCSEL_OSCIOFNC_POSITION               0x0000000A
#define _FOSCSEL_OSCIOFNC_MASK                   0x00000400
#define _FOSCSEL_OSCIOFNC_LENGTH                 0x00000001

#define _FOSCSEL_SOSCSEL_POSITION                0x0000000C
#define _FOSCSEL_SOSCSEL_MASK                    0x00001000
#define _FOSCSEL_SOSCSEL_LENGTH                  0x00000001

#define _FOSCSEL_FCKSM_POSITION                  0x0000000E
#define _FOSCSEL_FCKSM_MASK                      0x0000C000
#define _FOSCSEL_FCKSM_LENGTH                    0x00000002

#define _FOSCSEL_w_POSITION                      0x00000000
#define _FOSCSEL_w_MASK                          0xFFFFFFFF
#define _FOSCSEL_w_LENGTH                        0x00000020

#define _FSEC_CP_POSITION                        0x0000001F
#define _FSEC_CP_MASK                            0x80000000
#define _FSEC_CP_LENGTH                          0x00000001

#define _FSEC_w_POSITION                         0x00000000
#define _FSEC_w_MASK                             0xFFFFFFFF
#define _FSEC_w_LENGTH                           0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _EXTERNAL_1_VECTOR                       4
#define _EXTERNAL_2_VECTOR                       5
#define _EXTERNAL_3_VECTOR                       6
#define _EXTERNAL_4_VECTOR                       7
#define _CHANGE_NOTICE_A_VECTOR                  8
#define _CHANGE_NOTICE_B_VECTOR                  9
#define _CHANGE_NOTICE_C_VECTOR                  10
#define _TIMER_1_VECTOR                          11
#define _COMPARATOR_1_VECTOR                     12
#define _COMPARATOR_2_VECTOR                     13
#define _RTCC_VECTOR                             14
#define _ADC_VECTOR                              15
#define _CRC_VECTOR                              16
#define _HLVD_VECTOR                             17
#define _CLC1_VECTOR                             18
#define _CLC2_VECTOR                             19
#define _SPI1_ERR_VECTOR                         20
#define _SPI1_TX_VECTOR                          21
#define _SPI1_RX_VECTOR                          22
#define _UART1_RX_VECTOR                         23
#define _UART1_TX_VECTOR                         24
#define _UART1_ERR_VECTOR                        25
#define _I2C1_SLAVE_VECTOR                       26
#define _I2C1_MASTER_VECTOR                      27
#define _I2C1_BUS_VECTOR                         28
#define _CCP1_VECTOR                             29
#define _CCT1_VECTOR                             30
#define _CCP2_VECTOR                             31
#define _CCT2_VECTOR                             32
#define _CCP3_VECTOR                             33
#define _CCT3_VECTOR                             34
#define _SPI2_ERR_VECTOR                         37
#define _SPI2_TX_VECTOR                          38
#define _SPI2_RX_VECTOR                          39
#define _UART2_RX_VECTOR                         40
#define _UART2_TX_VECTOR                         41
#define _UART2_ERR_VECTOR                        42
#define _I2C2_SLAVE_VECTOR                       43
#define _I2C2_MASTER_VECTOR                      44
#define _I2C2_BUS_VECTOR                         45
#define _NVM_VECTOR                              46
#define _PERFORMANCE_COUNTER_VECTOR              47
#define _ECCSB_ERR_VECTOR                        49

/* Device Peripherals */
#define _CRU
#define _I2C1
#define _I2C2
#define _INT
#define _PORTA
#define _PORTB
#define _PORTC
#define _RTCC
#define _SPI1
#define _SPI2
#define _TMR1
#define _UART1
#define _UART2

/* Base Addresses for Peripherals */
#define _CRU_BASE_ADDRESS                        0xBF803E80
#define _I2C1_BASE_ADDRESS                       0xBF800400
#define _I2C2_BASE_ADDRESS                       0xBF800480
#define _INT_BASE_ADDRESS                        0xBF80F000
#define _PORTA_BASE_ADDRESS                      0xBF802600
#define _PORTB_BASE_ADDRESS                      0xBF802700
#define _PORTC_BASE_ADDRESS                      0xBF802800
#define _RTCC_BASE_ADDRESS                       0xBF800AA0
#define _SPI1_BASE_ADDRESS                       0xBF808080
#define _SPI2_BASE_ADDRESS                       0xBF808100
#define _TMR1_BASE_ADDRESS                       0xBF808000
#define _UART1_BASE_ADDRESS                      0xBF800600
#define _UART2_BASE_ADDRESS                      0xBF800680

/*  The following device macros are predefined by the chipKIT
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MM0016GPL028
#  define __32MM0016GPL028 1
#endif
#ifndef __32MM0016GPL028__
#  define __32MM0016GPL028__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32MM
#  define __PIC32MM 1
#endif
#ifndef __PIC32MM__
#  define __PIC32MM__ 1
#endif
/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_MCUASE
# define __PIC32_HAS_MCUASE 1
#endif

/* include generic header file for backwards compatibility with old C32 v1.xx code */
/* WARNING: Macros from this file are deprecated and should not be used in new     */
/*          source code.                                                           */
#include "ppic32mx.h"



#endif
